{
  "users": [
    {
      "email": "herciu.robert@gmail.com",
      "firstname": "Robert",
      "lastname": "Herciu",
      "password": "123",
      "retype-password": "123",
      "id": 1
    },
    {
      "email": "a@a.com",
      "firstname": "1",
      "lastname": "1",
      "password": "1",
      "retype-password": "1",
      "id": 2
    }
  ],
  "reservations": [],
  "notavailable_restaurants": [
    {
      "id": 1,
      "restaurantId": 1,
      "busy": "1#28/06/2020"
    },
    {
      "id": 3,
      "restaurantId": 3,
      "busy": "3#17/05/2020"
    },
    {
      "id": 4,
      "restaurantId": 4,
      "busy": "4#16/05/2020"
    },
    {
      "id": 5,
      "restaurantId": 5,
      "busy": "5#27/06/2020"
    },
    {
      "id": 6,
      "restaurantId": 5,
      "busy": "5#26/07/2020"
    },
    {
      "id": 7,
      "restaurantId": 6,
      "busy": "6#16/05/2020"
    },
    {
      "id": 8,
      "restaurantId": 7,
      "busy": "7#27/06/2020"
    },
    {
      "id": 9,
      "restaurantId": 7,
      "busy": "7#28/06/2020"
    },
    {
      "id": 10,
      "restaurantId": 8,
      "busy": "8#28/06/2020"
    },
    {
      "id": 11,
      "restaurantId": 9,
      "busy": "9#17/05/2020"
    },
    {
      "id": 12,
      "restaurantId": 10,
      "busy": "10#16/05/2020"
    },
    {
      "id": 12,
      "restaurantId": 10,
      "busy": "10#27/06/2020"
    }
  ],
  "notavailable_bands": [
    {
      "id": 1,
      "bandId": 1,
      "busy": "1#24/05/2020"
    },
    {
      "id": 3,
      "bandId": 3,
      "busy": "3#16/05/2020"
    },
    {
      "id": 4,
      "bandId": 4,
      "busy": "4#16/05/2020"
    },
    {
      "id": 5,
      "bandId": 4,
      "busy": "4#24/06/2020"
    },
    {
      "id": 6,
      "bandId": 5,
      "busy": "5#17/05/2020"
    },
    {
      "id": 7,
      "bandId": 5,
      "busy": "5#23/05/2020"
    }
  ],
  "notavailable_other": [
    {
      "id": 1,
      "otherId": 1,
      "busy": "1#17/05/2020"
    },
    {
      "id": 2,
      "otherId": 1,
      "busy": "1#27/06/2020"
    },
    {
      "id": 3,
      "otherId": 2,
      "busy": "2#16/05/2020"
    },
    {
      "id": 4,
      "otherId": 2,
      "busy": "2#23/05/2020"
    },
    {
      "id": 5,
      "otherId": 2,
      "busy": "2#24/05/2020"
    },
    {
      "id": 6,
      "otherId": 2,
      "busy": "2#28/06/2020"
    },
    {
      "id": 7,
      "otherId": 3,
      "busy": "3#13/06/2020"
    },
    {
      "id": 8,
      "otherId": 3,
      "busy": "3#21/06/2020"
    },
    {
      "id": 9,
      "otherId": 3,
      "busy": "3#27/06/2020"
    },
    {
      "id": 10,
      "otherId": 4,
      "busy": "4#16/05/2020"
    },
    {
      "id": 11,
      "otherId": 4,
      "busy": "4#27/06/2020"
    }
  ],
  "restaurants": [
    {
      "id": 1,
      "name": "Tess Ballroom - Salon Grand",
      "location": "Calea Brasovului 2, Ghimbav, Romania",
      "photo": "./images/Tessballroom.jpg",
      "capacity": 280,
      "price": 92,
      "rating": 4.8,
      "contact": "0732 950 805",
      "description": "Tess Balroom is a premium location, which provides a complete set of services to enjoy every moment of the event, in a refined, warm and stylish atmosphere. Whether it is a private party (wedding, baptism, birthday), corporate event (conference, gala, product launch), wine tasting or exhibition, everything can be successfully organized in the smallest details."
    },
    {
      "id": 2,
      "name": "Sergiana Event Center - Salonul Ivory",
      "location": "Centru Civic, Mihail Kogalniceanu 15, Brasov, Romania",
      "photo": "./images/sergiana-ivory.jpg",
      "capacity": 650,
      "price": 95,
      "rating": 4.1,
      "contact": "0728 979 956",
      "description": "With elegant chandeliers and refined finishes, the Ivory Salon exudes style. It is the largest salon at the Sergiana Center for events in Brasov and can be divided into 2 distinct, autonomous spaces, or it can be used as a unitary salon for large and sumptuous events with up to 650 guests. Equipped with its own sound system and a network of video projectors. It is located on the 1st floor (orientation towards the green area of ​​the park)."
    },
    {
      "id": 3,
      "name": "Sergiana Event Center - Salonul Argintiu",
      "location": "Centru Civic, Mihail Kogalniceanu 15, Brasov, Romania",
      "photo": "./images/sergiana-argintiu.jpg",
      "capacity": 150,
      "price": 85,
      "rating": 4.2,
      "contact": "0728 979 956",
      "description": "Modern with a classic air and subtle floral accents. An ideal space for trainings and conferences, but equally suitable for weddings, baptisms and anniversaries, because it allows different ways of arranging tables with 6, 8 or 10 seats at the table. It is located on mezzanine 1 (orientation towards Kogălniceanu Blvd.)."
    },
    {
      "id": 4,
      "name": "Sergiana Event Center - Salonul Auriu",
      "location": "Centru Civic, Mihail Kogalniceanu 15, Brasov, Romania",
      "photo": "./images/sergiana-auriu.jpg",
      "capacity": 260,
      "price": 90,
      "rating": 4.8,
      "contact": "0728 979 956",
      "description": "Bright and charming! With a special air and decorations in interesting colors. Ideal for conferences and symposia, but can also host large parties. It can be customized according to your requirements and expectations. With tables for 6, 8 or 10 seats, in the party version. It is located on mezzanine 2 (orientation towards M. Kogălniceanu Blvd.)."
    },
    {
      "id": 5,
      "name": "Sergiana Event Center - Salonul Pearl",
      "location": "Centru Civic, Mihail Kogalniceanu 15, Brasov, Romania",
      "photo": "./images/sergiana-pearl.jpg",
      "capacity": 110,
      "price": 68,
      "rating": 4,
      "contact": "0728 979 956",
      "description": "Intimate and delicate atmosphere. Central dance floor and table arrangement with 6, 8 or 10 seats Perfect for small events with a dedicated coffee-break and lunch area. It allows a separate playground for children, with inflatable toys and special furniture. It is located on the 1st floor (orientation towards sports fields)."
    },
    {
      "id": 6,
      "name": "Complex 3 Stejari",
      "location": "Str. Col. Kiss Sandor nr. 102, Dambu' Morii, Romania",
      "photo": "./images/complex-3-stejari.jpg",
      "capacity": 170,
      "price": 70,
      "rating": 4.4,
      "contact": "0758 111 016",
      "description": "Escape in the middle of nature to spend the Holy Easter holidays in a relaxed and family atmosphere, but also very close to the attractions of Brasov or the tourist resorts on Prahova Valley. And this year we have prepared a complex entertainment program for the little ones who will play in specially arranged places (indoor-outdoor) under the supervision of our animators disguised as fairy tale characters, thus giving parents the chance to relax in a the warm and spiritual atmosphere conducive to the Easter holidays."
    },
    {
      "id": 7,
      "name": "Restaurant Ambient",
      "location": "Bulevardul Iuliu Maniu Nr. 27, Brasov, Romania",
      "photo": "./images/restaurant-ambient.jpg",
      "capacity": 150,
      "price": 78,
      "rating": 4.2,
      "contact": "0268 471 747",
      "description": "You will be welcome at any time in our restaurant, where, sitting in one of the 150 seats, the flavors of international and Rmanian cuisine will take your senses on an unforgettable culinary journey. The comfortable space where the cuisine and the cellar are in perfect harmony, the saloons have been traditionally decorated, with elegant and discreet, with high quality furniture in italian style."
    },
    {
      "id": 8,
      "name": "Grand Restaurant - Salon Modern",
      "location": "Str. Mihail Kogalniceanu Nr. 15, Brasov, Romania",
      "photo": "./images/grand-restaurant.jpg",
      "capacity": 350,
      "price": 75,
      "rating": 4.4,
      "contact": "0268 336 795",
      "description": "The MODERN salon, the most spacious of the 4 salons, has a capacity between 180 and 350 people and is located on the 1st floor, with entrance from B-dul. Mihail Kogalniceanu. With an excellent attention to detail, this salon keeps the classic line, but the modernist paintings and details differentiate it."
    },
    {
      "id": 9,
      "name": "Ramada by Wyndham Brasov",
      "location": "Calea Bucurestiului, Nr. 13, Sacele, Brasov, Romania",
      "photo": "./images/ramada-restaurant.jpg",
      "capacity": 210,
      "price": 65,
      "rating": 3.6,
      "contact": "0268 508 009",
      "description": "Your worries will become our worries, dealing with the responsibility and professionalism that characterize us and offer us the leading position in the field. Elegant restaurants, prompt and distinguished service, quality and finesse of menus recommend the Ramada Brasov hotel as the perfect place for any celebration, and because your time is precious, we are with you and share our experience in creating the desired event."
    },
    {
      "id": 10,
      "name": "Restaurant Garden Club",
      "location": "Bulevardul Grivitei, Nr. A48, Stupini, Romania",
      "photo": "./images/garden-club-restaurant.jpg",
      "capacity": 220,
      "price": 82,
      "rating": 4.3,
      "contact": "0268 470 777",
      "description": "For the organization of an important event we provide you with all the necessary logistics: event tent with a capacity of 100-250 people seated in front of the pool that will create an enchanting atmosphere, restaurant with all the appropriate facilities that proposes different menu options to satisfy the most refined tastes and more than enough guest rooms. Beyond the excellent meal and the impeccable service, our advantage is the pleasant, intimate and relaxing ambiance."
    }
  ],
  "bands": [
    {
      "id": 1,
      "name": "Charm Band",
      "photo": "./images/charm-band.jpg",
      "price": 2000,
      "description": "The cover band Charm Band supports 100% Live shows, for all types of private parties: weddings, baptisms, corporate parties, but also private concerts. We have events all over the country, so we will be happy to come to your city as well. Specializing in artistic events, we are at your disposal with the most diverse musical genres, from the music of the '70s to the latest hits.",
      "contact": "0766 345 724"
    },
    {
      "id": 2,
      "name": "Lovis Events",
      "photo": "./images/lovis-band.jpg",
      "_notavailable": [],
      "price": 3000,
      "description": "Let's get to know each other! We are a live music band and we offer music services for any type of event. You can call on our services to request a wedding band or a christening band. Also, we can be with you with the music band at any anniversary party, company party, corporate party. Most of our musical genres are included in our repertoire, so we can adapt our program to any occasion. We provide complete musical services, both as a cover band, with Romanian and international light music soloists, as well as as a party music band, with professional instrumentalists and folk music soloists. We have state-of-the-art instruments and equipment that define an excellent sound system, light scaffolding, heavy smoke for the bride and groom's dance, carbonic ice for champagne glasses but also other complementary services, with which fun will be guaranteed.",
      "contact": "0726 193 808"
    },
    {
      "id": 3,
      "name": "Trupa Lov",
      "photo": "./images/trupa-lov.jpg",
      "price": 2500,
      "description": "We have a varied and unique party playlist, adaptable to any wedding theme, so your guests will feel not only at the hottest party with a super band, but will live a memorable live show live on the dance floor. Regardless of the city where you get married, we are  the cover band  for the wedding you can count on! We just need to know a few details about the hall in advance. It will be enough for us to set up a super show throughout the event!",
      "contact": "0769 219 050"
    },
    {
      "id": 4,
      "name": "Nicoleta Oancea & Band",
      "photo": "./images/Nicoleta-oancea-band.jpg",
      "price": 2200,
      "description": "Nicoleta Oancea & Band is a cover band made up of 6 talented, experienced musicians who have performed on stages across the country. Our team consists of vocal soloist, backing vocals, bassist, guitarist, keyboardist / pianist, drummer and has a full staff behind it: booking agent, sound engineer, technicians, tour manager. In order to offer a tailor-made show, we collaborate only with professional people, starting from the technical team (sound, stage, lights) to DJs, passionate people who get involved in their profession.",
      "contact": "0722 179 782"
    },
    {
      "id": 5,
      "name": "Blacklight Band",
      "photo": "./images/blacklight-band.jpg",
      "price": 1800,
      "description": "Wedding band from Bucharest, cover band, cover band or alchemists of good mood, whatever you want to call us - Blacklight Band is a team of musicians with a rich record, met on the big stages, figures known to the public and after many television appearances. The musical abilities of the members allow them to approach a very varied repertoire, sung in English, Romanian, Italian, Spanish, which crosses a multicolored stylistic palette, from the great international hits to the beloved Romanian songs, passing through pop music, disco, dance, blues , rock, rhythm and blues, soul, reggae, cantece italiene si latino; from immortal pieces to the latest appearances! In other words, superlative band for events!",
      "contact": "0744 326 258"
    }
  ],
  "other": [
    {
      "id": 1,
      "name": "Make-up Artist & Hairstyle",
      "photo": "./images/makeup_artists.jpg",
      "price": 75,
      "description": "During this challenging and unprecenteded time we won't be able to offer trials at the moment, but please know that holding your wedding date with only 75 euros is not only the safest way to ensure you keep your place.  It's refundable against your wedding booking, and also refundable if you decide to cancel before your trial so you've got nothing to lose!",
      "contact": "0725 326 429"
    },
    {
      "id": 2,
      "name": "Lasting Events Photo Booth",
      "photo": "./images/photo-booth.jpg",
      "price": 500,
      "description": "Lasting Events Photo Booth is a modern concept of open camera, without walls, with the printing of pictures on the spot. It is a unique way of entertainment for weddings, christenings, anniversary parties, as well as for corporate parties, product launches, fairs, exhibitions. Do you have an event or a party where you will be surrounded by family / friends / colleagues? In this case Funky Photobooth takes care of the good mood of the guests! We come with the equipment, and the guests must come with fun pictures and have fun!",
      "contact": "0799 980 921"
    },
    {
      "id": 3,
      "name": "Flawless Events",
      "photo": "./images/flawless-events.jpg",
      "price": 1000,
      "description": "As a home-based florist, we don't have the high overhead costs that big retailers do. This lets us offer high quality arrangements at substantial savings. Whether your special day is a backyard shindig or a black tie affair, we'll help you create the perfect floral ambiance.",
      "contact": "0758 527 359"
    },
    {
      "id": 4,
      "name": "Foto y Cafe",
      "photo": "./images/photo-cafe.jpg",
      "price": 500,
      "description": "When photography meets with unique landscape and beautiful people, creativity is bound to knock on the brain doors. As a Transylvania wedding photographer, I am willing to travel across the globe, meet new people, experience new cultures and observe new sceneries. Those days of being limited to a city to create stories are far gone; the era of visiting new places has arrived and bound to last for aeon a time.",
      "contact": "0766 610 055"
    }
  ]
}